node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 667373
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "jdl=\322\304\200\276\024^B\275\346l\34597\216\264\275\233;\365\275\022\240c>e\205w\275$\315\212=\202p\275\2758z\206\276B\n\r;)\320\031\276\3777\210\276\2111\024\276\n\372\240=\017\220M\275\351\212W\276m\022,\276\016\032W\276Y\275\214\275!5[>\355e\006=\006\235\257<\377@\207=\345\215\265=~f\312<\343}=\274\371\000\225>,\373G>-CD=\241\353\005=\300`p=\264,)\276\245\212\233\275:L\235=\213w\323=k\375\350\271\017\352\241\275\\\214\030\275\356-D\276\203\214/\276\023\211\360\275DG$>Fy\362;d1\024=\306\201U\274}L\303=\237\016\036\276\373)k>\032\350\027\275\000\325^>\343QX\273\342Z\354<Db\217\275U\364\033\2767\266\202=V\367\017\275\"Dp=\342~`=\223+P\275\021[\364<\374#|\276\247\033A\2753,\033\276\357g\026\276\343.\205\275\266&\002>\2353l\275^iS\276\374\261\334=\017\220\276=\321mM\276\240LL=\033\247\244=\350\260Z\276\237\335\215\276\255s}=C$6\275\331k\337=\303c\275\275 \220#>\n\346(\275\356\251\371<4\252p>Y\373X\275>\301\241=\360\230\204>\030\362\277<\rO\227<\217``>Cr3\276uu\342;\3322\007\276\205\312\241\274uT\244<^\033\032\275rUj<\336\315\326\274P<%>\325T\317<\347C\227\274$\037Z>\213.\036=v\t>=y]\227\276V\351\343=u\325E>\317#U\275\033\274\206\275\375\211H\274\276\017\030\276\230U >\200\241\343=W\325\024\276I#\256=#\003\363\270\350\021\372\275\002\375U=\265\361\017\276*9\205\276\351\245|>\256\037\014\276_\344\274\275\276T\211\275fh9=\233\010L>Ms\003>\377\024<>\025\313\321\275\227\254p\275\001\344\267=\207\205@>g2\273<Tb^>\316\2624\275\320.\021>\274\376[\276\372\3622\275ez+\273s$\355=Z\226\016\276\361\260\014\275i\037\256\273]R\250\275%\027N=\022\016\257\275\232\t\032=rW\t>F\215\233=\305\302\377=\026\262\004>\360\305\336\275\363G=\276(\367\r>Zx\335\273s?\036\276\277\221\211>\226\001:\274\347\265~\275\2123L\275C\326=\275\233\365\234>\036\025\355\275\346o\301<vC\310\275\323\254\301\274\356\271E\2750)!\275\333|\376=\217\345\324=-|\301=\261&\232=\035\254O\276\257\260<=\335\341\327<\211\211\320<\221\220\203>\027-\345=\277\371\274=!\3755>\232H.=\333P\233=\022\213\322<W\272\032\2740>_>.\311\213>\273\206\370\275\333\351\035>\004\367\252\275\362I^\275\304\013\277<Y\366\312\275<\243\013>M\000\023=\372\361\320\275\262O>\276:\347\216>\2363\241=\216M\275=\017\010\373=}2\244=N\226\347\274)O\372;\343\370\200=\245\230\235=7m\307\275\020\027\277\274\216\352#>\365hb>^\340\'<\301\264G>\226\367\273\273\200v\315\274\363.\365=\361\332\241=R\025$>\307\014Y\276y\221f<\207\247q<\376\033I\275\013`\n\276<\207\222=\253\276?\276\204\021\222\275X\365\221=\242\021n\275R\201\251=\342*\226=+\262&\2763\332\351=\206<\221\276\261R\215=R^\267\274w\344\201\275\217\314\330\275]L\004>\270<\322=s{a\276=2\211>\\\367 \276\"\341\010\275\371\341\013>/\"|\275Bc|<\013w\370\274Z\303\211\275\177tG\275P,\323;\255\362\244\275\003q\312<\035\003\013=\024\357 \276\207\307\243=7\0333=?\021 \275p\334W\274\373\315\007>/E\353\275\007\031\326<\206-P>\223:\202\276A\227{\275\326\316\206\276\206iG\276P\313\007\274\210)\351=\313\310+\276\321\r\273\275\010\025J>FK\224\275\2131\256=\'\021W\276\000,\r\276\303^[\274$h\036>e\276\222\275\327\314*=\3165\215>\330w!>\362\333\325\275\313[R\276M\317]\275\006\010@\276\313\t\260=d\264\253=Fi\010<\2618\352=K]\\\276#Rs=\201V)\276\375;\231=J\004\251=N\227\344=\314\006\301\275m\321\327\275\355m\r\276>\3035\276\014\246f\275\3600~\276@\n\001=\025k\026>\220\230X>=wW\274)\027\310<\331\265\257\275MV\304;z\243\331\275\271k\215\276\331\210\216\276\245\250:\276\246\266\374;!\3245>\216\262\325\275\257\250i\275c\345\301\275\212\230\010\276\222$\362=\324\\\226=\337\230\373\275\022U\014\276\362\327\270\275\362\371\026\276\305\331M\275\"\253\324=\263\210\246\275\266\226\215<!\263*\276\351\353\007<\235\331\211\275\266\341\220\27560\237=\221l\232\276aK\003=1\303\221\275\227\327l<\365\376\035\275\373BS\275o\372!\275\202\305\t\276L{A\275\nx\225\275[N\313>\021cJ>\007N\235=\026f\t>\353\306\224=\323|\213\275i\326\332=\004 \366<\231\334\263\274\371y\032\275\305\335T\275\205\257I>\034X\342=p\340\325\273\367\356B>\356G\263\275\323.>>\366\224\027=\276\\\031=\261\003\202\275\317\225\373\275\227j\242\273.\201\364<2\t\225\275/\206\307\275H\362\237\276v\251\245=\277\272\266<j}\365=hd\024\275\255\037\034\276h\373f>e\330H=\367,\010>\223\003\037\276\244\240\">\036\254&\276\376\216\334\275G\030\361\275=\033\365\275\212\207\236=\360\033\351<\306\216A\275\277\234m>\323}\323\275\013\273\206\274\016H\201=\373\326o\275\260V%\273\372\001\236\276C$\203=\251Jr\276\374/\263<\323Uq98K\202\275\361\004\006>f\374\023>^\034\264\275\005\n\004>#\302k\276|\001\322=9\310J\275\214\275\263<\250\3144=\227\034\r\276\213\371!\276\010\356\217>\265\222\342=\365\344\262\274\321\224q=7\"\203\276\226\215_\275C\275}\2754\201\243=\201\tL>sJu<b\257|=\243\221\241;\313g\354\273\234c%=]BR\273\347\313g\276\177\237\362=G\377\321\275\305\317\367=\005\350(9_$=\276\370\324\024>\207+\323=\317z\217>4\3420\276\340\267!\276\027\234\206=\337\337\372\275s3\205\275\256\000\347\273\231VP\276\225\320Y\275\225\212\200>|\272\261\275\030\211\211=hZ\003>l=\245\275\230\306<> <\207\275\346\r\346<m\033\315\275\003P\351=\361\r\210=\036~6\276\360r\211\274\223\321\235=\006\344\314=\021\307J\275\035\366\327\275\035\177\031\276#\031\244\274\203^L=]&c\275\261O\\=W\372\276=\\n\251>Y\006\257\273u\315j>\223\331\271=\234g\211\276\016\203\031=\307)\260<G\013\204=-\375>\273\317e9>\325f\r\275\371n\035\274B\230(=F\243.\276H\337W\275\303w;\276\246b\">\276d\036>\273M\022=/\267\336\274\303\212s>\036A\030=\362\330\344=\352v\001\274\367\257|\276\204\370\350\275\013\030o>\014M\310\274lV\233\275\332\346\246>\260\225w\276\363\222?\275\311o]=\014\245W\276\317\301\275<\357Q\341\275}U\214\275@/\004>_\\!\275\256 S>\215\211\357=u\201\230\275gL\220=\372Z#\275,\360\333\275\275\355\022\276\322\361\237<\177\263*\274\0233\230\275y\211\207\273mv\220\275h\026\026>I\325A\275\032\233\277\272\303\205\261=\303\277\021>z\221\330<\240\357O=\252!\034\275gz\263=\370\310\216;L\345\025\276\350u~\276u\212\301=\347\226\223>\210\205\n\276\261Nu=\232>&\276\35335\275\n\014\235>\020\200\016\274\330?\340<.#\346=|w\230=\213;\334<\347zW=\306\213.=7\371\310\275\014\234k\276\373\241\026=^\217\375\273\"\3218\276@;\204\274\252\354\250\275c\273\243\275\037\321&>\227%b\276\272\317n>0l\375\275\361g\206=\n\016#\276\"u\020\276%&\334\274\254\r\010\274O\252c\275\344\322\303=o\256\201\274\031RD>MEu\275\375\335\036\273\r\270\031\276v\016\234\276\002 \242\274\035a\332\275\232uy>\022\2062\274\306\310\210;d~n\275y\277\210\275N\347\306<e\266\365=v\214}\276\244\3569>\035;5>\262\026Z>y\212{=]\364\253\273909\276\217\020\t=\227\231Y=\301\026\264=\261\243\263\275$2\312<\211\241$>\002\267\305\275\031_\246=Y*\021\276^\226\277<\203:\t\276\265\356\301=\377v\334\275\005\337A\275\251\'\001>\362\350!>\375\216\350\275\216:\240=\2116Q>\325\332\374=A\257\314=\337x\020\274\031<N\276k\202\316\275\336P\255\275\370J\032>\341p\307=\013to<\227n >\004\301c=\331\204\241=\004\202>>\266\023/=\024\264?>3\263\325=\331\3125<\332\220\221=\376I\022>\354\246M\274\210\022\370\275%\242\367=\304\232W\274\371|\266\2745\2004\276\260\327\014=\177\371-=3\r\370<eNQ=\323\227\226\273\325\345^>H\271\n\276q\204a>\016\311\217=\n[\360;\002\020N\275\330\341\366=\256I\244=M\270\353=`\005\345=\262<V\275\370b\247\275c\tZ<\233\251+<\026\255\232\273\275~\300>\022\373\'\276x\230N\275#\013\230\276\344F\262\275\201\2378\276\002\265,\276%\220\247=o)%>\371<\332=\177 \035\275\345\273f>\026S\360;\202Ce>\342\034\032\2761(\336=\020(\370=\366(\220<\026`q<B\241w\276\240K\350\274\"\356\257\275\273\005\200\273\304\231C\275\303\270\244=\373\023\331=\366\307\365<\037\203\004>\325\034N=\244\322\311\274}\235=\275X&<=\364\022`=\206f\356\275\212\225\344\274\312\215y=q)\006>\213}\366\275\300\007\334\275\300G\223\274z!+\275\007\354d\275\220\261\037>\252\254\'\276\001\371\240>\223C\237\274\277\317*\275F{\251\275t\001\304\275\277\205\346\275\267\215\235\276\325\033b\276\315\310\214\275\251\352\202\275|9~\276\003a\344\275\213\202.\275\260h\036\276\267\371\247\275\037s\211\276\234/\025>\274Og\274-c4>\2642B=\267\306`>kK\241>S\006\006\276\nF\304\275\204\375\331\274\006\363\022\274\216|j\274\205\021\371\274\026\232\030\276(\305\'>\026\013\355\274T\230\223\276\016\365\206>9_>\275\252G\327\275\177*\212\275\325c\320<\027\255\305=[\357\376\275\225\325->h\037\252\274\036\003\241\274.\\\007\274\"\245\215=C\373\000>x\246M\276\354\"_\274\312\312F\275O\026\352\275]iY\276^,m=\345\206\004\276\214\333\275=\326>\223=\245\022y>\3465\237\275\227\372\003\276-T\366=WyU\275\351\243F\275r\231->\222\316~\274I\272\254\276\033K}\276(\035\">\202t\"\275fn\032>\201&Z>ld\337\275\351l\256=\344\n(\276\244\305\316=\334AH\275\203\033A\276\014@\351\274\307\005\032>C\024\317<z\237\302=)\371\245=\260\\\345<\006\356\t\276\246*\236=\001S\266<aw\201=_\211e=\341ma>V\351\326\274\322\242I<\253\036c=\217+\233:g&\002\274p?%\276&\034\342=\263P/>l\373\205>n\325\322\275\233\200\004=\365\367\262=\344~y<\347\360T\275\320L\001\275_\002L\275Y\204\222\275n\335\337\274UK>\276bS-\276O\273\372\275\374\243Z<\033\005\355\275\017\335\275\275\312\246\361=\002\315T;\033\214+>\nN\202>\375 \216\274\260\0069\276Zu\r=Qd\014=y\226\356\275\022\302\327=!]\241\275i\034\231<\230U\036\276F\237\341=oav\275\236\007\251<St\241\276\027~\273<?j\367\274v\206\003>\255.%\275\365\332\021\276\207\301q=\037\265\210>0\'\036\276\301\244\247=\323C\230\274?t\034\276|^3\276\247\027/\275\276x=\276g\017H=\227\277\025\276\227&^\276\234Q\344<\323\275a\276\n\265\335\275\237\230&\276\226\324\307\275\341\343g\275D\366\344\275\022\350\001=\021\340\312\276\003\325f\276\277\004\037\274\365\004\202=\247-\326\275 \007>;@U:<B\333R\276\267\276\352\274N\264\221\275B\005\212=O\221\003>**`>E\222\206\275\306\205\026\275\037\340\017>]\255\337<\001\223G=\010\020\376<\202\241\234;\341\270\001\276\233\317\210>\\j\367\274\314k\000\276\317\233L\276\306r\201=d\274s\275\351\343\020<\247s\305\274\3037\203>w\320\217;\375\206\265\274\331\r\306=\346\313\003\276|\035\000\276%L\354\275B\037P\275\r\364\273=\217\376z\275j\3642\276\t6\255\276#\207\034=A\361\325=<\324*=\027{\300\275\002\332\324\2743{\361=\253\037}=\255\333\314\275\376>\003>\221\207\346\2752R\216\274\253\331#=\316\004\032>\342\035\274\275\034\377\346\275:@y>\310\220\237\275T\270\214=\344\302\n>\340\2079>>\351D\276\217\023\225=E\343s\2757\214\200\2741Z\237\275o\347\222\276{R\237<\201\237\002\276?\307\020>9y\007\275\340\221\316=\202\357\272=r\301\335=k/\273=\312h$=\\\316(\276\020\"\"\275I\030\301\275\ra\317<gRF=i-\005>Kn\347<\332\340\202>\377T\216;\213\302\241=\242M\340;KO7\275\360\3424\276\252\026\205\276\2338f;t6E<\274S#\275b{\270\275\004\322\027>\177\320\243\275=\225\251\275\306?_\276C\270s=Np\200\276\250\030O\276\203\274\350<\304\230&\275\325\372\251=\364\253,>kH\305=\313\336\005\276\376?m\276\020|d\275\276\236\244\275\224\252e\276D\374\336<\324\224\205\276|\333\254<?\037\303\275\202\306V\276\232\344\225;\017\370\013\275\231\305\210\275a\353\001=\010\037\332<A\325G=\024z\273<i\220\324\275y7\034>\252\223\321<zb\206\274\272\300\200\275%\t;\276\224v\025=\317\022\267\266%\031\265\275\274\'\210=o\215\276=\032\204\030\276\312\276 =\202S\262\275\274\2751=\303\000\223\274\245\020\337\275\361\313\247\273\212\322F>\255\233k\275fV\267\276\212\021(=m\251,\276\010m\242>\232/\376\273\026\3604\276]`?\276\351\330a\274\263\271\257\275\330\177\330<\233\254t>y\264\354\275\357\275\362\275\276q\343\275\216\332%\276s\311\361\274\302\321\271=pPL\274\373\365\237\275\345Q-> G.>j\366\325<v\332Y\275\324os>\350s:=tJ\352=\327\035\024\276\316\327.=\243M\272=\003\373\r\275*\262l=\3147\230\276\361mb>\\\374\376\274=h\027\276-e\363\275\023\266a>\240\343\335;\000\263$\276\367\256\214\273\236\205\363\275\325\350\'>?\306F=\025v\366=\207>\210\275\272p \276y\307\242<L\256H\273*\032L=V\001\254;*H\r\276K#\226=\257a\264;l\225\227=\375\\0\276F\'V==\035D\275\351\264)\276\300!\004=\312\346\221;+\202\006\276\345\345^\275\020U\252>*\310\033\274\260\037\270=\211\265\322=\255\357\233\275<Ff=\263\323\r>-\270\377\275XCF>\025D\255=\021\235\203\275\004\322\220\2759\302\215=\356\202*=\177\324G\273\036DN>%z\277=\340\2410>z\\\266<\354\353\201>+-#>N\236h>\217)\017\275\315\365P\276\205\305\220=\250\031\022>\2275\210\276\246n:\276\277~\022\275\372\267\224>H\274\020=$\227Z=H\003\033\274\201R\236\275\2641!>;6\003<z\344\244=\306n\254=X\374\333</E4\276\312sR>\362\377\005>\330\302\000\276\r\217\031>k\256m=S\254\245<4o\260\273\372\314\205=\256X\201\274\262p\\>\237\217\354\274\322\311\306<\214;4>w\303(>\214u\270\275\233\245\241\275\013\222\244\274\374\261G\273\340\307=\276P\335F>\214\275==\254\253\354=\030\300B>\224\345j>0\335\244\276\206\232\035\276\3732\036\276\351M\245\275\r\216\200\275\240\034\306=\274\005\235<\274\347\202>\357}r\276\336\245\353;\223\333\001>Ha$\2752\241\271=\211IZ=r\037^\274Y\202?\276\004\032\270=\255\327\200<Ti\240\275|\265j\275Nd\325<X\345\002\276?:\t\276\325\262\016>w\372\004>\316a\222\275x\244\212\276\325w\372;\317=\372\274K\\$=\362oO\276\211k\215\275H[\325\275\205\323>\276\262AD>j\346\037=\207G\377<\036\263D\275\332y\226\275\305\315\010>9\335\330\274\017!\263=\n\322A\275.\354\007\2767\231\206\276\370\265\017>\347\336\000\275<R\206\275\245\377*\274#@\272\276n\207G\275p7\252=\202\213\025\276\241\350k\275XK\226<\343\366==\020(\267=/&g>,\210}\276\274\327F>\314_\030\275P\370\013>\017\014\206=*\220*=\031\354\335=i\235\221\275Aw\334\275\330\257\217=Dz\372\274\260\272w=@{N\275\365j\371<\001\323\006>Y?]\276\310l\254=\254=\224\2757]\306=\354\345\244<P>\233=\327\367\025\276\255C\032\276#k|\276\377TR\276q\255\026\275\217\'\327=\243-\374\275\261X+>\353\374\255=\005x\355\275e\003\341\275"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
